tutorials/incompressible/pimpleFoam/LES/channel395DFSEM/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

// Ub/utau = 17.55
internalField   uniform ( 17.55 0 0 );

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    topWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    sides_half0
    {
        type            cyclic;
    }
    sides_half1
    {
        type            cyclic;
    }
    inlet
    {
        type            turbulentDFSEMInlet;
        delta           2;
        nCellPerEddy    1;
        mapMethod       nearestCell;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
